content/usercase/sto/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 640.0;

vertices        
(
(0 0 0)
(0 0.5 0)
(0.5 0.5 0)
(0.5 0 0)
(0.5 -0.5 0)
(0 -0.5 0)
(-0.5 -0.5 0)
(-0.5 0 0)
(-0.5 0.5 0)

(0 1 0)
(0.7071 0.7071 0)
(1 0 0)
(0.7071 -0.7071 0)
(0 -1 0)
(-0.7071 -0.7071 0)
(-1 0 0)
(-0.7071 0.7071 0)


(0 0 0.5)
(0 0.5 0.5)
(0.5 0.5 0.5)
(0.5 0 0.5)
(0.5 -0.5 0.5)
(0 -0.5 0.5)
(-0.5 -0.5 0.5)
(-0.5 0 0.5)
(-0.5 0.5 0.5)

(0 1 0.5)
(0.7071 0.7071 0.5)
(1 0 0.5)
(0.7071 -0.7071 0.5)
(0 -1 0.5)
(-0.7071 -0.7071 0.5)
(-1 0 0.5)
(-0.7071 0.7071 0.5)

);

blocks          
(
    hex (0 3 2 1 17 20 19 18) (40 40 40) simpleGrading (1 1 3.4942) // inre boxen 1
    hex (0 5 4 3 17 22 21 20) (40 40 40) simpleGrading (1 1 3.4942) // inre boxen 2
    hex (0 7 6 5 17 24 23 22) (40 40 40) simpleGrading (1 1 3.4942) // inre boxen 3
    hex (0 1 8 7 17 18 25 24) (40 40 40) simpleGrading (1 1 3.4942) // inre boxen 4
    hex (1 2 10 9 18 19 27 26) (40 40 40) simpleGrading (1 1 3.4942) // kvadrant 1
    hex (2 3 11 10 19 20 28 27) (40 40 40) simpleGrading (1 1 3.4942) // kvadrant 2
    hex (3 4 12 11 20 21 29 28) (40 40 40) simpleGrading (1 1 3.4942) // kvadrant 3
    hex (4 5 13 12 21 22 30 29) (40 40 40) simpleGrading (1 1 3.4942) // kvadrant 4
    hex (5 6 14 13 22 23 31 30) (40 40 40) simpleGrading (1 1 3.4942) // kvadrant 5
    hex (6 7 15 14 23 24 32 31) (40 40 40) simpleGrading (1 1 3.4942) // kvadrant 6
    hex (7 8 16 15 24 25 33 32) (40 40 40) simpleGrading (1 1 3.4942) // kvadrant 7
    hex (8 1 9 16 25 18 26 33) (40 40 40) simpleGrading (1 1 3.4942) // kvadrant 8
);

edges           
(
arc 9 10 (0.5 0.8660 0)
arc 10 11 (0.8660 0.5 0)
arc 11 12 (0.8660 -0.5 0)
arc 12 13 (0.5 -0.8660 0)
arc 13 14 (-0.5 -0.8660 0)
arc 14 15 (-0.8660 -0.5 0)
arc 15 16 (-0.8660 0.5  0)
arc 16 9 (-0.5 0.8660 0)

arc 26 27 (0.5 0.8660 0.5)
arc 27 28 (0.8660 0.5 0.5)
arc 28 29 (0.8660 -0.5 0.5)
arc 29 30 (0.5 -0.8660 0.5)
arc 30 31 (-0.5 -0.8660 0.5)
arc 31 32 (-0.8660 -0.5 0.5)
arc 32 33 (-0.8660 0.5  0.5)
arc 33 26 (-0.5 0.8660 0.5)
);


boundary
(
    sector1
    {
        type patch;
        faces
        (
(9 10 27 26)
	);
    }

    sector2
    {
        type patch;
        faces
        (
(10 11 28 27)
	);
    }

    sector3
    {
        type patch;
        faces
        (
(11 12 29 28)
	);
    }

    sector4
    {
        type patch;
        faces
        (
(12 13 30 29)
        );
    }

    sector5
    {
        type patch;
        faces
        (
(13 14 31 30)
	);
    }

    sector6
    {
        type patch;
        faces
        (
(14 15 32 31)
	);
    }

    sector7
    {
        type patch;
        faces
        (
(15 16 33 32)
	);
    }

    sector8
    {
        type patch;
        faces
        (
(16 9 26 33)
        );
    }

    sky
    {
        type symmetry;
        faces
        (
(17 20 19 18)
(17 22 21 20)
(17 24 23 22)
(17 18 25 24)

(18 19 27 26)
(19 20 28 27)
(20 21 29 28)
(21 22 30 29)
(22 23 31 30)
(23 24 32 31)
(24 25 33 32)
(25 18 26 33)
        );
    }

    ground
    {
        type wall;
        faces
        (
(0 3 2 1)
(0 5 4 3)
(0 7 6 5)
(0 1 8 7)

(1 2 10 9)
(2 3 11 10)
(3 4 12 11)
(4 5 13 12)
(5 6 14 13)
(6 7 15 14)
(7 8 16 15)
(8 1 9 16)
        );
    }
);


mergePatchPairs 
(
);

// ************************************************************************* //

