content/usercase/sto/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    sector1
    {
        type atmBoundaryLayerInletVelocity;
	#include "include/ABLConditions"
    }

    sector2
    {
        type atmBoundaryLayerInletVelocity;
	#include "include/ABLConditions"
    }

    sector3
    {
        type atmBoundaryLayerInletVelocity;
	#include "include/ABLConditions"
    }

    sector4
    {
        type atmBoundaryLayerInletVelocity;
	#include "include/ABLConditions"
    }

    sector5
    {
        type zeroGradient;
    }

    sector6
    {
        type zeroGradient;
    }

    sector7
    {
        type zeroGradient;
    }

    sector8
    {
        type zeroGradient;
    }

    wall
    {
        type            uniformFixedValue;
	uniformValue    (0 0 0);
        value           uniform (0 0 0);
    }

    ground
    {
        type            uniformFixedValue;
	uniformValue    (0 0 0);
        value           uniform (0 0 0);
    }



    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
