content/usercase/sto/0.orig/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 4.522;
Zref                 51;
zDir                 (0 0 1);
flowDir              (-.70710678118654752116 .70710678118654752763 0);
z0                   uniform 1.8;
zGround              uniform 0.0;
//value                $internalField;

// ************************************************************************* //
